[
  {
    "id": "company_001",
    "category": "company_information",
    "title": "What are SPT's current company statistics and achievements?",
    "content": "Standard Pension Trust has achieved significant milestones: 8 branches across Ghana, serving over 150,000 members, partnering with 2,000+ employers, and maintaining a 100% prompt payout record. These statistics demonstrate our commitment to reliable pension services and nationwide accessibility.",
    "keywords": ["8 branches", "150,000 members", "2,000 employers", "100% prompt payouts", "statistics", "achievements"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "company_002",
    "category": "company_information",
    "title": "What is SPT's mission and vision?",
    "content": "Standard Pension Trust is dedicated to providing secure, reliable pension services that help Ghanaians build financial security for retirement. We combine traditional values with modern financial solutions to serve diverse communities across Ghana.",
    "keywords": ["mission", "vision", "secure pension", "financial security", "retirement", "traditional values"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "company_003",
    "category": "company_information",
    "title": "How does SPT ensure nationwide accessibility?",
    "content": "With 8 strategically located branches across Ghana, SPT ensures members can access services conveniently. Our branch network covers major cities and regions, providing in-person support alongside digital services for comprehensive accessibility.",
    "keywords": ["nationwide accessibility", "8 branches", "strategic locations", "in-person support", "comprehensive access"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "company_004",
    "category": "company_information",
    "title": "What makes SPT's payout record reliable?",
    "content": "SPT maintains a 100% prompt payout record, ensuring all eligible pension benefits are paid on time without delays. This reliability is backed by sound financial management, regulatory compliance, and commitment to member welfare.",
    "keywords": ["100% prompt payouts", "reliable", "on time", "financial management", "regulatory compliance", "member welfare"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "company_005",
    "category": "company_information",
    "title": "How does SPT serve both individual members and employers?",
    "content": "SPT serves over 150,000 individual members while partnering with 2,000+ employers to provide comprehensive pension solutions. We offer tailored services for both individual retirement planning and corporate pension scheme management.",
    "keywords": ["individual members", "employers", "150,000 members", "2,000 employers", "tailored services", "corporate schemes"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "company_006",
    "category": "company_information",
    "title": "What is SPT's branch network structure and coverage?",
    "content": "SPT operates a comprehensive network of 8 branches strategically located across Ghana's major cities and regions. Our branches are in Greater Accra (main office), Takoradi, Kumasi, Ho, Dunkwaw-on-Offin, Cape Coast, Techiman, and additional regional locations. This network ensures that pension services are accessible to members nationwide, providing both in-person support and digital services. Each branch is fully equipped to handle all pension-related services including account management, contributions, claims processing, and consultations.",
    "keywords": ["8 branches", "branch network", "strategic locations", "nationwide coverage", "major cities", "in-person support", "digital services", "pension services", "account management"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:Z"
  },
  {
    "id": "company_007",
    "category": "company_information",
    "title": "Does SPT have physical branch locations?",
    "content": "YES, SPT has 8 physical branch locations across Ghana. We are NOT just an online-only service. Our branches provide in-person support, face-to-face consultations, document verification, and local customer service. Our branches are located in Greater Accra (main office), Takoradi, Kumasi, Ho, Dunkwaw-on-Offin, Cape Coast, Techiman, and additional regional locations. Each branch offers comprehensive pension services including account opening, contribution processing, benefit claims, pension planning consultations, and customer support. We combine physical branch accessibility with digital services for the best member experience.",
    "keywords": ["physical branches", "8 branches", "in-person support", "face-to-face consultations", "document verification", "local customer service", "not online-only", "physical locations", "branch network"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  }
]