[
  {
    "id": "trauma_001",
    "category": "financial_trauma",
    "title": "How do I overcome fear of investing after losing money in previous financial schemes?",
    "content": "Healing financial trauma requires gradual trust rebuilding: start with small, reversible investments to build positive experiences, educate yourself about institutional differences and regulatory protections, seek counseling for financial trauma if needed, and separate past experiences from current opportunities through informed analysis.",
    "keywords": ["fear of investing", "financial trauma", "trust rebuilding", "small investments", "regulatory protections", "counseling"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_002",
    "category": "financial_trauma",
    "title": "What if I don't trust financial institutions because of past family financial losses?",
    "content": "Family financial trauma creates deep institutional skepticism. Address through: understanding regulatory differences between past and current institutions, seeking independent verification of institutional stability, starting with minimal exposure while building confidence, and recognizing that avoiding all financial institutions guarantees retirement insecurity.",
    "keywords": ["family trauma", "institutional skepticism", "regulatory differences", "independent verification", "minimal exposure", "retirement insecurity"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_003",
    "category": "financial_trauma",
    "title": "How does SPT help members who've been victims of investment fraud regain confidence?",
    "content": "SPT provides trauma-informed financial services: transparent explanation of regulatory protections unavailable in fraudulent schemes, gradual engagement options for confidence building, educational resources about recognizing legitimate vs. fraudulent opportunities, and emotional support for financial decision-making anxiety.",
    "keywords": ["investment fraud", "trauma-informed", "regulatory protections", "gradual engagement", "educational resources", "emotional support"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_004",
    "category": "financial_trauma",
    "title": "What steps help rebuild financial confidence after economic crises or currency devaluations?",
    "content": "Crisis recovery involves: understanding how regulated pension funds protect against institutional failures, learning about diversification benefits reducing single-point failure risks, starting with conservative investment options while rebuilding confidence, and focusing on long-term protection rather than short-term market movements.",
    "keywords": ["economic crises", "currency devaluations", "regulated pension funds", "diversification", "conservative investments", "long-term protection"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_005",
    "category": "financial_trauma",
    "title": "How do I distinguish between legitimate pension planning and potential financial scams?",
    "content": "Identify legitimate institutions through: NPRA licensing verification, physical office locations and regulatory reporting, transparent fee structures and investment policies, no guaranteed unrealistic returns promises, and professional staff credentials. Avoid high-pressure tactics and too-good-to-be-true promises.",
    "keywords": ["legitimate planning", "financial scams", "NPRA licensing", "physical offices", "transparent fees", "professional credentials"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_006",
    "category": "financial_trauma",
    "title": "What psychological support exists for members dealing with financial decision-making anxiety?",
    "content": "Support includes: educational resources reducing anxiety through knowledge, financial counseling services for decision-making support, peer support groups for shared experiences, gradual exposure therapy through small initial investments, and professional mental health referrals when needed.",
    "keywords": ["psychological support", "financial anxiety", "educational resources", "financial counseling", "peer support", "mental health"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_007",
    "category": "financial_trauma",
    "title": "How can family members support someone recovering from financial trauma while planning pensions?",
    "content": "Family support involves: patient encouragement without pressure, education about current regulatory protections, celebration of small progress steps, emotional support during anxiety episodes, and helping research institutional credibility. Avoid dismissing trauma while encouraging gradual progress.",
    "keywords": ["family support", "financial trauma", "regulatory protections", "progress steps", "emotional support", "institutional credibility"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_008",
    "category": "financial_trauma",
    "title": "What institutional safeguards does SPT provide that weren't available in past problematic schemes?",
    "content": "SPT operates under comprehensive regulatory framework: NPRA licensing and oversight, segregated member fund custody, independent auditing requirements, capital adequacy standards, and government supervision. These protections didn't exist in historical problematic schemes that caused financial trauma.",
    "keywords": ["institutional safeguards", "NPRA licensing", "segregated funds", "independent auditing", "capital adequacy", "government supervision"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_009",
    "category": "financial_trauma",
    "title": "How do I start pension planning when I'm overwhelmed by financial decision-making?",
    "content": "Overcome overwhelm through: starting with minimal contribution amounts to reduce decision pressure, using default investment options while learning, seeking one-on-one guidance for personalized support, breaking decisions into small manageable steps, and focusing on progress rather than perfection.",
    "keywords": ["overwhelm", "minimal contributions", "default options", "one-on-one guidance", "manageable steps", "progress focus"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_010",
    "category": "financial_trauma",
    "title": "What role does financial education play in healing from previous financial losses?",
    "content": "Education provides empowerment and control: understanding how protective regulations work, learning to evaluate financial institutions independently, developing critical thinking about financial offers, building confidence through knowledge, and transforming victim mentality into informed consumer approach.",
    "keywords": ["financial education", "empowerment", "protective regulations", "independent evaluation", "critical thinking", "informed consumer"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_011",
    "category": "financial_trauma",
    "title": "How can communities help members overcome collective financial trauma from past institutional failures?",
    "content": "Community healing involves: sharing accurate information about current regulatory protections, providing peer support for gradual institutional engagement, collective education about financial institution evaluation, community leader endorsement of legitimate institutions, and group approaches to initial pension planning.",
    "keywords": ["community healing", "regulatory protections", "peer support", "collective education", "community leaders", "group approaches"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_012",
    "category": "financial_trauma",
    "title": "What gradual exposure strategies help overcome institutional fear while building retirement security?",
    "content": "Gradual exposure includes: starting with minimal contributions to build positive experiences, using short-term savings products before long-term pensions, visiting institutional offices to build familiarity, meeting successful members for peer reassurance, and increasing engagement based on comfort development.",
    "keywords": ["gradual exposure", "minimal contributions", "short-term savings", "office visits", "successful members", "comfort development"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_013",
    "category": "financial_trauma",
    "title": "How do I handle family members who discourage formal financial planning due to past trauma?",
    "content": "Address family skepticism through: patient education about regulatory changes since past problems, sharing success stories of institutional stability, involving family in institutional research, demonstrating small positive experiences, and respecting trauma while advocating for current opportunities.",
    "keywords": ["family skepticism", "regulatory changes", "success stories", "institutional research", "positive experiences", "trauma respect"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_014",
    "category": "financial_trauma",
    "title": "What red flags should I watch for to avoid repeating past financial mistakes?",
    "content": "Warning signs include: unrealistic return guarantees, high-pressure sales tactics, lack of regulatory licensing, no physical office locations, requests for large upfront payments, promises of exclusive opportunities, and evasive answers about fees or risks. Trust institutional verification over sales presentations.",
    "keywords": ["red flags", "unrealistic returns", "high-pressure sales", "regulatory licensing", "physical offices", "upfront payments"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  },
  {
    "id": "trauma_015",
    "category": "financial_trauma",
    "title": "How does ongoing institutional monitoring provide confidence for trauma survivors?",
    "content": "Continuous monitoring includes: regular regulatory compliance reporting, transparent financial statement publication, member complaint resolution tracking, independent audit results sharing, and responsive customer service. Ongoing transparency provides confidence that initial trust decisions remain valid.",
    "keywords": ["ongoing monitoring", "regulatory compliance", "transparent statements", "complaint resolution", "audit results", "customer service"],
    "createdAt": "2024-01-01T00:00:00Z",
    "updatedAt": "2024-01-01T00:00:00Z"
  }
]
